import * as S from "./styled";

export const HomePage = () => {
  return (
    <S.Wrapper>
      <S.MainText>
        “미래의 너에게, 오늘의 나를 담아 보내요.” <br />
      </S.MainText>
      <S.SubText>
        이건 단순한 편지가 아니에요.<br /> 시간을 넘어 미래로 전해지는 감성 타임캡슐입니다.<br /> 당신은 오늘의 이야기, 소중한 추억, 누군가를 향한 진심을 편지에 담아, 그 편지가 열릴 날과 시간을 정할 수 있어요.<br /> 그리고 그날이 되기 전까지, 그 편지는 고이 봉인된 채로 기다립니다. 기다림 속에서 더욱 빛날 당신의 마음을 미래에 전해보세요. <br /><br />

        편지를 받는 순간의 설렘, 기다림이 만들어내는 따뜻한 감동, 그 모든 것을 우리는 사랑합니다.<br /> 당신의 편지를 기다릴 누군가는 그 순간, 당신의 이야기에 웃고, 울고, 마음 깊이 감동받을지도 몰라요.<br /><br />

        이건 단지 메시지를 보내는 것이 아니라, 오늘의 나를 미래에 남겨두는 특별한 방법입니다.<br /> 그리운 마음을 더 깊이 새기고 싶을 때, 사랑하는 이에게 진심을 담고 싶을 때, 우리의 타임캡슐 편지는 당신의 이야기를 더 아름답게 전해줄 거예요.<br />
      </S.SubText>
    </S.Wrapper>
  )
}

export default HomePage;